# Задание 2 (обязательно). Свой баг-репорт
#Самостоятельно придумать и оформить один новый баг на ту же тему (изменяемость/alias/hashable), которого не было в каталоге семинара. Файл hw3/my_bug.py должен содержать три части подряд:
# 1. багованный код (5-10 строк);
# 2. комментарий в 2-3 предложения: что происходит и почему;
# 3. исправленная версия.
# Запрещается просто переформулировать чужой пример с семинара другими именами переменных - цель в том, чтобы придумать свою ситуацию, а не скопировать готовый.


class Player:
    inventory = []


player1 = Player()
player2 = Player()

player1.inventory.append("Меч")
player2.inventory.append("Зелье")
print(f"Инвентарь Игрока 1: {player1.inventory}")
print(f"Инвентарь Игрока 2: {player2.inventory}")


# Комментарий:

# Возникает алиасинг на уровне атрибутов класса. Список `inventory` инициализируется один раз при создании класса,
# и все объекты (player1 и player2) ссылаются на один и тот же мутабельный объект списка в памяти.
# Изменение списка через один инстанс мгновенно отражается на всех остальных.
# Чтобы решить проблему, предлагается для каждого игрока через __init__ создавать свой отдельный инвентарь


class PlayerFixed:
    def __init__(self):
        self.inventory = []


p1_fixed = PlayerFixed()
p2_fixed = PlayerFixed()

p1_fixed.inventory.append("Меч")
p2_fixed.inventory.append("Зелье")
print(f"Инвентарь Игрока 1: {p1_fixed.inventory}")
print(f"Инвентарь Игрока 2: {p2_fixed.inventory}")
